var wallObj=function(){
    //this.orange=new Image();
    //this.white=new Image();
    this.all=new Image();
    //定义地图数组，0表示不画，1表示红墙，2表示白墙，3表示草地，4表示河流
    this.map=[];
}
wallObj.prototype.init=function(){
    this.all.src="./img/tankAll.gif";
    this.map=[
        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,4],
        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,4],
        [0,0,0,1,1,0,0,0,0,0,0,0,0,0,1,1,0,0,3,4],
        [0,0,0,0,1,1,0,0,0,0,0,0,0,1,1,0,0,0,3,4],
        [0,0,2,2,0,1,1,0,0,0,0,0,1,1,0,2,2,0,3,4],
        [0,0,2,2,2,0,1,1,0,0,0,1,1,0,2,2,2,0,3,4],
        [0,0,0,0,0,0,0,1,1,0,1,1,0,0,0,0,0,0,3,4],
        [0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0],
        [3,3,3,3,3,3,3,3,3,0,0,0,3,3,3,3,3,3,3,3],
        [0,0,0,4,4,4,0,0,0,0,0,0,0,0,0,4,4,4,0,0],
        [3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,3,3,3,3,3]
    ];
}
wallObj.prototype.draw=function(){
    ctx.save();
    for(var i=0;i<this.map.length;i++){
        for(var j=0;j<this.map[i].length;j++){
            if(this.map[i][j]>0){
                ctx.drawImage(this.all,(this.map[i][j]-1)*16,98,16,16,30*j,30*i,30,30);
            }
        }
    }


    ctx.restore();
}